SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_burtc.h
/* Bit fields for BURTC EN */
#define _BURTC_EN_RESETVALUE                    0x00000000UL                            /**< Default value for BURTC_EN                  */
#define _BURTC_EN_MASK                          0x00000003UL                            /**< Mask for BURTC_EN                           */
#define BURTC_EN_EN                             (0x1UL << 0)                            /**< BURTC Enable                                */
#define _BURTC_EN_EN_SHIFT                      0                                       /**< Shift value for BURTC_EN                    */
#define _BURTC_EN_EN_MASK                       0x1UL                                   /**< Bit mask for BURTC_EN                       */
#define _BURTC_EN_EN_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for BURTC_EN                   */
#define BURTC_EN_EN_DEFAULT                     (_BURTC_EN_EN_DEFAULT << 0)             /**< Shifted mode DEFAULT for BURTC_EN           */
#define BURTC_EN_DISABLING                      (0x1UL << 1)                            /**< Disablement busy status                     */
#define _BURTC_EN_DISABLING_SHIFT               1                                       /**< Shift value for BURTC_DISABLING             */
#define _BURTC_EN_DISABLING_MASK                0x2UL                                   /**< Bit mask for BURTC_DISABLING                */
#define _BURTC_EN_DISABLING_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for BURTC_EN                   */
#define BURTC_EN_DISABLING_DEFAULT              (_BURTC_EN_DISABLING_DEFAULT << 1)      /**< Shifted mode DEFAULT for BURTC_EN           */

/* Bit fields for BURTC CFG */
#define _BURTC_CFG_RESETVALUE                   0x00000000UL                            /**< Default value for BURTC_CFG                 */
#define _BURTC_CFG_MASK                         0x000000F3UL                            /**< Mask for BURTC_CFG                          */
#define BURTC_CFG_DEBUGRUN                      (0x1UL << 0)                            /**< Debug Mode Run Enable                       */
#define _BURTC_CFG_DEBUGRUN_SHIFT               0                                       /**< Shift value for BURTC_DEBUGRUN              */
#define _BURTC_CFG_DEBUGRUN_MASK                0x1UL                                   /**< Bit mask for BURTC_DEBUGRUN                 */
#define _BURTC_CFG_DEBUGRUN_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for BURTC_CFG                  */
#define _BURTC_CFG_DEBUGRUN_X0                  0x00000000UL                            /**< Mode X0 for BURTC_CFG                       */
#define _BURTC_CFG_DEBUGRUN_X1                  0x00000001UL                            /**< Mode X1 for BURTC_CFG                       */
#define BURTC_CFG_DEBUGRUN_DEFAULT              (_BURTC_CFG_DEBUGRUN_DEFAULT << 0)      /**< Shifted mode DEFAULT for BURTC_CFG          */
#define BURTC_CFG_DEBUGRUN_X0                   (_BURTC_CFG_DEBUGRUN_X0 << 0)           /**< Shifted mode X0 for BURTC_CFG               */
#define BURTC_CFG_DEBUGRUN_X1                   (_BURTC_CFG_DEBUGRUN_X1 << 0)           /**< Shifted mode X1 for BURTC_CFG               */
#define BURTC_CFG_COMPTOP                       (0x1UL << 1)                            /**< Compare Channel is Top Value                */
#define _BURTC_CFG_COMPTOP_SHIFT                1                                       /**< Shift value for BURTC_COMPTOP               */
#define _BURTC_CFG_COMPTOP_MASK                 0x2UL                                   /**< Bit mask for BURTC_COMPTOP                  */
#define _BURTC_CFG_COMPTOP_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for BURTC_CFG                  */
#define _BURTC_CFG_COMPTOP_DISABLE              0x00000000UL                            /**< Mode DISABLE for BURTC_CFG                  */
#define _BURTC_CFG_COMPTOP_ENABLE               0x00000001UL                            /**< Mode ENABLE for BURTC_CFG                   */
#define BURTC_CFG_COMPTOP_DEFAULT               (_BURTC_CFG_COMPTOP_DEFAULT << 1)       /**< Shifted mode DEFAULT for BURTC_CFG          */
#define BURTC_CFG_COMPTOP_DISABLE               (_BURTC_CFG_COMPTOP_DISABLE << 1)       /**< Shifted mode DISABLE for BURTC_CFG          */
#define BURTC_CFG_COMPTOP_ENABLE                (_BURTC_CFG_COMPTOP_ENABLE << 1)        /**< Shifted mode ENABLE for BURTC_CFG           */
#define _BURTC_CFG_CNTPRESC_SHIFT               4                                       /**< Shift value for BURTC_CNTPRESC              */
#define _BURTC_CFG_CNTPRESC_MASK                0xF0UL                                  /**< Bit mask for BURTC_CNTPRESC                 */
#define _BURTC_CFG_CNTPRESC_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for BURTC_CFG                  */
#define _BURTC_CFG_CNTPRESC_DIV1                0x00000000UL                            /**< Mode DIV1 for BURTC_CFG                     */
#define _BURTC_CFG_CNTPRESC_DIV2                0x00000001UL                            /**< Mode DIV2 for BURTC_CFG                     */
#define _BURTC_CFG_CNTPRESC_DIV4                0x00000002UL                            /**< Mode DIV4 for BURTC_CFG                     */
#define _BURTC_CFG_CNTPRESC_DIV8                0x00000003UL                            /**< Mode DIV8 for BURTC_CFG                     */
#define _BURTC_CFG_CNTPRESC_DIV16               0x00000004UL                            /**< Mode DIV16 for BURTC_CFG                    */
#define _BURTC_CFG_CNTPRESC_DIV32               0x00000005UL                            /**< Mode DIV32 for BURTC_CFG                    */
#define _BURTC_CFG_CNTPRESC_DIV64               0x00000006UL                            /**< Mode DIV64 for BURTC_CFG                    */
#define _BURTC_CFG_CNTPRESC_DIV128              0x00000007UL                            /**< Mode DIV128 for BURTC_CFG                   */
#define _BURTC_CFG_CNTPRESC_DIV256              0x00000008UL                            /**< Mode DIV256 for BURTC_CFG                   */
#define _BURTC_CFG_CNTPRESC_DIV512              0x00000009UL                            /**< Mode DIV512 for BURTC_CFG                   */
#define _BURTC_CFG_CNTPRESC_DIV1024             0x0000000AUL                            /**< Mode DIV1024 for BURTC_CFG                  */
#define _BURTC_CFG_CNTPRESC_DIV2048             0x0000000BUL                            /**< Mode DIV2048 for BURTC_CFG                  */
#define _BURTC_CFG_CNTPRESC_DIV4096             0x0000000CUL                            /**< Mode DIV4096 for BURTC_CFG                  */
#define _BURTC_CFG_CNTPRESC_DIV8192             0x0000000DUL                            /**< Mode DIV8192 for BURTC_CFG                  */
#define _BURTC_CFG_CNTPRESC_DIV16384            0x0000000EUL                            /**< Mode DIV16384 for BURTC_CFG                 */
#define _BURTC_CFG_CNTPRESC_DIV32768            0x0000000FUL                            /**< Mode DIV32768 for BURTC_CFG                 */
#define BURTC_CFG_CNTPRESC_DEFAULT              (_BURTC_CFG_CNTPRESC_DEFAULT << 4)      /**< Shifted mode DEFAULT for BURTC_CFG          */
#define BURTC_CFG_CNTPRESC_DIV1                 (_BURTC_CFG_CNTPRESC_DIV1 << 4)         /**< Shifted mode DIV1 for BURTC_CFG             */
#define BURTC_CFG_CNTPRESC_DIV2                 (_BURTC_CFG_CNTPRESC_DIV2 << 4)         /**< Shifted mode DIV2 for BURTC_CFG             */
#define BURTC_CFG_CNTPRESC_DIV4                 (_BURTC_CFG_CNTPRESC_DIV4 << 4)         /**< Shifted mode DIV4 for BURTC_CFG             */
#define BURTC_CFG_CNTPRESC_DIV8                 (_BURTC_CFG_CNTPRESC_DIV8 << 4)         /**< Shifted mode DIV8 for BURTC_CFG             */
#define BURTC_CFG_CNTPRESC_DIV16                (_BURTC_CFG_CNTPRESC_DIV16 << 4)        /**< Shifted mode DIV16 for BURTC_CFG            */
#define BURTC_CFG_CNTPRESC_DIV32                (_BURTC_CFG_CNTPRESC_DIV32 << 4)        /**< Shifted mode DIV32 for BURTC_CFG            */
#define BURTC_CFG_CNTPRESC_DIV64                (_BURTC_CFG_CNTPRESC_DIV64 << 4)        /**< Shifted mode DIV64 for BURTC_CFG            */
#define BURTC_CFG_CNTPRESC_DIV128               (_BURTC_CFG_CNTPRESC_DIV128 << 4)       /**< Shifted mode DIV128 for BURTC_CFG           */
#define BURTC_CFG_CNTPRESC_DIV256               (_BURTC_CFG_CNTPRESC_DIV256 << 4)       /**< Shifted mode DIV256 for BURTC_CFG           */
#define BURTC_CFG_CNTPRESC_DIV512               (_BURTC_CFG_CNTPRESC_DIV512 << 4)       /**< Shifted mode DIV512 for BURTC_CFG           */
#define BURTC_CFG_CNTPRESC_DIV1024              (_BURTC_CFG_CNTPRESC_DIV1024 << 4)      /**< Shifted mode DIV1024 for BURTC_CFG          */
#define BURTC_CFG_CNTPRESC_DIV2048              (_BURTC_CFG_CNTPRESC_DIV2048 << 4)      /**< Shifted mode DIV2048 for BURTC_CFG          */
#define BURTC_CFG_CNTPRESC_DIV4096              (_BURTC_CFG_CNTPRESC_DIV4096 << 4)      /**< Shifted mode DIV4096 for BURTC_CFG          */
#define BURTC_CFG_CNTPRESC_DIV8192              (_BURTC_CFG_CNTPRESC_DIV8192 << 4)      /**< Shifted mode DIV8192 for BURTC_CFG          */
#define BURTC_CFG_CNTPRESC_DIV16384             (_BURTC_CFG_CNTPRESC_DIV16384 << 4)     /**< Shifted mode DIV16384 for BURTC_CFG         */
#define BURTC_CFG_CNTPRESC_DIV32768             (_BURTC_CFG_CNTPRESC_DIV32768 << 4)     /**< Shifted mode DIV32768 for BURTC_CFG         */

/* Bit fields for BURTC CMD */
#define _BURTC_CMD_RESETVALUE                   0x00000000UL                            /**< Default value for BURTC_CMD                 */
#define _BURTC_CMD_MASK                         0x00000003UL                            /**< Mask for BURTC_CMD                          */
#define BURTC_CMD_START                         (0x1UL << 0)                            /**< Start BURTC counter                         */
#define _BURTC_CMD_START_SHIFT                  0                                       /**< Shift value for BURTC_START                 */
#define _BURTC_CMD_START_MASK                   0x1UL                                   /**< Bit mask for BURTC_START                    */
#define _BURTC_CMD_START_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for BURTC_CMD                  */
#define BURTC_CMD_START_DEFAULT                 (_BURTC_CMD_START_DEFAULT << 0)         /**< Shifted mode DEFAULT for BURTC_CMD          */
#define BURTC_CMD_STOP                          (0x1UL << 1)                            /**< Stop BURTC counter                          */
#define _BURTC_CMD_STOP_SHIFT                   1                                       /**< Shift value for BURTC_STOP                  */
#define _BURTC_CMD_STOP_MASK                    0x2UL                                   /**< Bit mask for BURTC_STOP                     */
#define _BURTC_CMD_STOP_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for BURTC_CMD                  */
#define BURTC_CMD_STOP_DEFAULT                  (_BURTC_CMD_STOP_DEFAULT << 1)          /**< Shifted mode DEFAULT for BURTC_CMD          */

/* Bit fields for BURTC STATUS */
#define _BURTC_STATUS_RESETVALUE                0x00000000UL                            /**< Default value for BURTC_STATUS              */
#define _BURTC_STATUS_MASK                      0x00000003UL                            /**< Mask for BURTC_STATUS                       */
#define BURTC_STATUS_RUNNING                    (0x1UL << 0)                            /**< BURTC running status                        */
#define _BURTC_STATUS_RUNNING_SHIFT             0                                       /**< Shift value for BURTC_RUNNING               */
#define _BURTC_STATUS_RUNNING_MASK              0x1UL                                   /**< Bit mask for BURTC_RUNNING                  */
#define _BURTC_STATUS_RUNNING_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for BURTC_STATUS               */
#define BURTC_STATUS_RUNNING_DEFAULT            (_BURTC_STATUS_RUNNING_DEFAULT << 0)    /**< Shifted mode DEFAULT for BURTC_STATUS       */
#define BURTC_STATUS_LOCK                       (0x1UL << 1)                            /**< Configuration Lock Status                   */
#define _BURTC_STATUS_LOCK_SHIFT                1                                       /**< Shift value for BURTC_LOCK                  */
#define _BURTC_STATUS_LOCK_MASK                 0x2UL                                   /**< Bit mask for BURTC_LOCK                     */
#define _BURTC_STATUS_LOCK_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for BURTC_STATUS               */
#define _BURTC_STATUS_LOCK_UNLOCKED             0x00000000UL                            /**< Mode UNLOCKED for BURTC_STATUS              */
#define _BURTC_STATUS_LOCK_LOCKED               0x00000001UL                            /**< Mode LOCKED for BURTC_STATUS                */
#define BURTC_STATUS_LOCK_DEFAULT               (_BURTC_STATUS_LOCK_DEFAULT << 1)       /**< Shifted mode DEFAULT for BURTC_STATUS       */
#define BURTC_STATUS_LOCK_UNLOCKED              (_BURTC_STATUS_LOCK_UNLOCKED << 1)      /**< Shifted mode UNLOCKED for BURTC_STATUS      */
#define BURTC_STATUS_LOCK_LOCKED                (_BURTC_STATUS_LOCK_LOCKED << 1)        /**< Shifted mode LOCKED for BURTC_STATUS        */

/* Bit fields for BURTC IF */
#define _BURTC_IF_RESETVALUE                    0x00000000UL                            /**< Default value for BURTC_IF                  */
#define _BURTC_IF_MASK                          0x00000003UL                            /**< Mask for BURTC_IF                           */
#define BURTC_IF_OF                             (0x1UL << 0)                            /**< Overflow Interrupt Flag                     */
#define _BURTC_IF_OF_SHIFT                      0                                       /**< Shift value for BURTC_OF                    */
#define _BURTC_IF_OF_MASK                       0x1UL                                   /**< Bit mask for BURTC_OF                       */
#define _BURTC_IF_OF_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for BURTC_IF                   */
#define BURTC_IF_OF_DEFAULT                     (_BURTC_IF_OF_DEFAULT << 0)             /**< Shifted mode DEFAULT for BURTC_IF           */
#define BURTC_IF_COMP                           (0x1UL << 1)                            /**< Compare Match Interrupt Flag                */
#define _BURTC_IF_COMP_SHIFT                    1                                       /**< Shift value for BURTC_COMP                  */
#define _BURTC_IF_COMP_MASK                     0x2UL                                   /**< Bit mask for BURTC_COMP                     */
#define _BURTC_IF_COMP_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for BURTC_IF                   */
#define BURTC_IF_COMP_DEFAULT                   (_BURTC_IF_COMP_DEFAULT << 1)           /**< Shifted mode DEFAULT for BURTC_IF           */

/* Bit fields for BURTC IEN */
#define _BURTC_IEN_RESETVALUE                   0x00000000UL                            /**< Default value for BURTC_IEN                 */
#define _BURTC_IEN_MASK                         0x00000003UL                            /**< Mask for BURTC_IEN                          */
#define BURTC_IEN_OF                            (0x1UL << 0)                            /**< Overflow Interrupt Flag                     */
#define _BURTC_IEN_OF_SHIFT                     0                                       /**< Shift value for BURTC_OF                    */
#define _BURTC_IEN_OF_MASK                      0x1UL                                   /**< Bit mask for BURTC_OF                       */
#define _BURTC_IEN_OF_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for BURTC_IEN                  */
#define BURTC_IEN_OF_DEFAULT                    (_BURTC_IEN_OF_DEFAULT << 0)            /**< Shifted mode DEFAULT for BURTC_IEN          */
#define BURTC_IEN_COMP                          (0x1UL << 1)                            /**< Compare Match Interrupt Flag                */
#define _BURTC_IEN_COMP_SHIFT                   1                                       /**< Shift value for BURTC_COMP                  */
#define _BURTC_IEN_COMP_MASK                    0x2UL                                   /**< Bit mask for BURTC_COMP                     */
#define _BURTC_IEN_COMP_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for BURTC_IEN                  */
#define BURTC_IEN_COMP_DEFAULT                  (_BURTC_IEN_COMP_DEFAULT << 1)          /**< Shifted mode DEFAULT for BURTC_IEN          */

/* Bit fields for BURTC PRECNT */
#define _BURTC_PRECNT_RESETVALUE                0x00000000UL                            /**< Default value for BURTC_PRECNT              */
#define _BURTC_PRECNT_MASK                      0x00007FFFUL                            /**< Mask for BURTC_PRECNT                       */
#define _BURTC_PRECNT_PRECNT_SHIFT              0                                       /**< Shift value for BURTC_PRECNT                */
#define _BURTC_PRECNT_PRECNT_MASK               0x7FFFUL                                /**< Bit mask for BURTC_PRECNT                   */
#define _BURTC_PRECNT_PRECNT_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for BURTC_PRECNT               */
#define BURTC_PRECNT_PRECNT_DEFAULT             (_BURTC_PRECNT_PRECNT_DEFAULT << 0)     /**< Shifted mode DEFAULT for BURTC_PRECNT       */

/* Bit fields for BURTC CNT */
#define _BURTC_CNT_RESETVALUE                   0x00000000UL                            /**< Default value for BURTC_CNT                 */
#define _BURTC_CNT_MASK                         0xFFFFFFFFUL                            /**< Mask for BURTC_CNT                          */
#define _BURTC_CNT_CNT_SHIFT                    0                                       /**< Shift value for BURTC_CNT                   */
#define _BURTC_CNT_CNT_MASK                     0xFFFFFFFFUL                            /**< Bit mask for BURTC_CNT                      */
#define _BURTC_CNT_CNT_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for BURTC_CNT                  */
#define BURTC_CNT_CNT_DEFAULT                   (_BURTC_CNT_CNT_DEFAULT << 0)           /**< Shifted mode DEFAULT for BURTC_CNT          */

/* Bit fields for BURTC EM4WUEN */
#define _BURTC_EM4WUEN_RESETVALUE               0x00000000UL                            /**< Default value for BURTC_EM4WUEN             */
#define _BURTC_EM4WUEN_MASK                     0x00000003UL                            /**< Mask for BURTC_EM4WUEN                      */
#define BURTC_EM4WUEN_OFEM4WUEN                 (0x1UL << 0)                            /**< Overflow EM4 Wakeup Enable                  */
#define _BURTC_EM4WUEN_OFEM4WUEN_SHIFT          0                                       /**< Shift value for BURTC_OFEM4WUEN             */
#define _BURTC_EM4WUEN_OFEM4WUEN_MASK           0x1UL                                   /**< Bit mask for BURTC_OFEM4WUEN                */
#define _BURTC_EM4WUEN_OFEM4WUEN_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for BURTC_EM4WUEN              */
#define BURTC_EM4WUEN_OFEM4WUEN_DEFAULT         (_BURTC_EM4WUEN_OFEM4WUEN_DEFAULT << 0) /**< Shifted mode DEFAULT for BURTC_EM4WUEN      */
#define BURTC_EM4WUEN_COMPEM4WUEN               (0x1UL << 1)                            /**< Compare Match EM4 Wakeup Enable             */
#define _BURTC_EM4WUEN_COMPEM4WUEN_SHIFT        1                                       /**< Shift value for BURTC_COMPEM4WUEN           */
#define _BURTC_EM4WUEN_COMPEM4WUEN_MASK         0x2UL                                   /**< Bit mask for BURTC_COMPEM4WUEN              */
#define _BURTC_EM4WUEN_COMPEM4WUEN_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for BURTC_EM4WUEN              */
#define BURTC_EM4WUEN_COMPEM4WUEN_DEFAULT       (_BURTC_EM4WUEN_COMPEM4WUEN_DEFAULT << 1) /**< Shifted mode DEFAULT for BURTC_EM4WUEN      */

